Autodesk.Navisworks.Api.Schema.Field
Base class for all fields used within SchemaDefinitions.

Autodesk.Navisworks.Api.Schema.Field.Concepts
Field-specific semantics associated with this field.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Schema.Field.DisplayNameId
The field's display name internal ID. Used for looking up the localized display name.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaCompiledException' thrown
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'display_name_id' is not convertable to a 7-bit ASCII string

Autodesk.Navisworks.Api.Schema.Field.Id
The identifier for the field.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.InvalidOperationException:
C++ exception 'LcUSchemaCompiledException' thrown
Throws System.ArgumentException:
Provided field ID is invalid or missing. 7-bit ASCII without spaces must be used.
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'id' is not convertable to a 7-bit ASCII string

Autodesk.Navisworks.Api.Schema.Field.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Schema.Field.ValueEquals(Autodesk.Navisworks.Api.Schema.Field)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.Schema.Field.ValueEquals(Autodesk.Navisworks.Api.Schema.Field,Autodesk.Navisworks.Api.Schema.Field)
Compares the two references 'By Value'